zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70144.atdf
        <module name="USBHS" id="11292" version="G">
          <instance name="USBHS">
            <register-group address-space="base" name="USBHS" name-in-module="USBHS" offset="0x40038000"/>
            <parameters>
              <param name="INSTANCE_ID" value="34"/>
              <param name="CLOCK_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="UTMI" id="11300" version="A">
          <instance name="UTMI">
            <register-group address-space="base" name="UTMI" name-in-module="UTMI" offset="0x400E0400"/>
          </instance>
        </module>
        <module name="WDT" id="6080" version="N">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1850"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="K">
          <instance name="XDMAC">
            <register-group address-space="base" name="XDMAC" name-in-module="XDMAC" offset="0x40078000"/>
            <parameters>
              <param name="INSTANCE_ID" value="58"/>
              <param name="CLOCK_ID" value="58"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
        <module name="MPU">
          <instance name="MPU">
            <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
          </instance>
        </module>
        <module name="FPU">
          <instance name="FPU">
            <register-group address-space="base" offset="0xE000EF34" name-in-module="FPU" name="FPU"/>
          </instance>
        </module>
        <module name="EBI" id="A" version="A">
          <instance name="EBI">
            <signals>
              <signal pad="PC18" function="A" group="A0"/>
              <signal pad="PC18" function="A" group="NBS0"/>
              <signal pad="PC18" function="A" group="DQM0"/>
              <signal pad="PC19" function="A" group="A1"/>
              <signal pad="PC20" function="A" group="A2"/>
              <signal pad="PC20" function="A" group="SDA0"/>
              <signal pad="PC21" function="A" group="A3"/>
              <signal pad="PC21" function="A" group="SDA1"/>
              <signal pad="PC22" function="A" group="A4"/>
              <signal pad="PC22" function="A" group="SDA2"/>
              <signal pad="PC23" function="A" group="A5"/>
              <signal pad="PC23" function="A" group="SDA3"/>
              <signal pad="PC24" function="A" group="A6"/>
              <signal pad="PC24" function="A" group="SDA4"/>
              <signal pad="PC25" function="A" group="A7"/>
              <signal pad="PC25" function="A" group="SDA5"/>
              <signal pad="PC26" function="A" group="A8"/>
              <signal pad="PC26" function="A" group="SDA6"/>
              <signal pad="PC27" function="A" group="A9"/>
              <signal pad="PC27" function="A" group="SDA7"/>
              <signal pad="PC28" function="A" group="A10"/>
              <signal pad="PC28" function="A" group="SDA8"/>
              <signal pad="PC29" function="A" group="A11"/>
              <signal pad="PC29" function="A" group="SDA9"/>
              <signal pad="PC30" function="A" group="A12"/>
              <signal pad="PC31" function="A" group="A13"/>
              <signal pad="PC31" function="A" group="SDA11"/>
              <signal pad="PA18" function="C" group="A14"/>
              <signal pad="PA18" function="C" group="SDA12"/>
              <signal pad="PA19" function="C" group="A15"/>
              <signal pad="PA19" function="C" group="SDA13"/>
              <signal pad="PA20" function="C" group="A16"/>
              <signal pad="PA20" function="C" group="BA0"/>
              <signal pad="PA0" function="C" group="A17"/>
              <signal pad="PA0" function="C" group="BA1"/>
              <signal pad="PA1" function="C" group="A18"/>
              <signal pad="PA23" function="C" group="A19"/>
              <signal pad="PA24" function="C" group="A20"/>
              <signal pad="PC16" function="A" group="A21"/>
              <signal pad="PC16" function="A" group="NANDALE"/>
              <signal pad="PC17" function="A" group="A22"/>
              <signal pad="PC17" function="A" group="NANDCLE"/>
              <signal pad="PA25" function="C" group="A23"/>
              <signal pad="PD17" function="C" group="CAS"/>
              <signal pad="PC0" function="A" group="D0"/>
              <signal pad="PC1" function="A" group="D1"/>
              <signal pad="PC2" function="A" group="D2"/>
              <signal pad="PC3" function="A" group="D3"/>
              <signal pad="PC4" function="A" group="D4"/>
              <signal pad="PC5" function="A" group="D5"/>
              <signal pad="PC6" function="A" group="D6"/>
              <signal pad="PC7" function="A" group="D7"/>
              <signal pad="PE0" function="A" group="D8"/>
              <signal pad="PE1" function="A" group="D9"/>
              <signal pad="PE2" function="A" group="D10"/>
              <signal pad="PE3" function="A" group="D11"/>
              <signal pad="PE4" function="A" group="D12"/>
              <signal pad="PE5" function="A" group="D13"/>
              <signal pad="PA15" function="A" group="D14"/>
              <signal pad="PA16" function="A" group="D15"/>
              <signal pad="PC9" function="A" group="NANDOE"/>
              <signal pad="PC10" function="A" group="NANDWE"/>
              <signal pad="PC14" function="A" group="NCS0"/>
              <signal pad="PC15" function="A" group="NCS1"/>
              <signal pad="PC15" function="A" group="SDCS"/>
              <signal pad="PD18" function="A" group="NCS1"/>
              <signal pad="PD18" function="A" group="SDCS"/>
              <signal pad="PA22" function="C" group="NCS2"/>
              <signal pad="PC12" function="A" group="NCS3"/>
              <signal pad="PD19" function="A" group="NCS3"/>
              <signal pad="PC11" function="A" group="NRD"/>
              <signal pad="PC13" function="A" group="NWAIT"/>
              <signal pad="PC8" function="A" group="NWR0"/>
              <signal pad="PC8" function="A" group="NWE"/>
              <signal pad="PD15" function="C" group="NWR1"/>
              <signal pad="PD15" function="C" group="NBS1"/>
              <signal pad="PD15" function="C" group="DQM1"/>
              <signal pad="PD16" function="C" group="RAS"/>
              <signal pad="PC13" function="C" group="SDA10"/>
              <signal pad="PD13" function="C" group="SDA10"/>
              <signal pad="PD23" function="C" group="SDCK"/>
              <signal pad="PD14" function="C" group="SDCKE"/>
              <signal pad="PD29" function="C" group="SDWE"/>
            </signals>
          </instance>
        </module>
        <module name="OSCILLATOR">
          <instance name="OSCILLATOR">
            <signals>
              <signal pad="PB9" function="X1" group="XIN"/>
              <signal pad="PB8" function="X1" group="XOUT"/>
              <signal pad="PA7" function="X1" group="XIN32"/>
              <signal pad="PA8" function="X1" group="XOUT32"/>
            </signals>
          </instance>
        </module>
        <module name="PORT_CAPTURE">
          <instance name="PORT">
            <signals>
              <signal pad="PA3" function="X1" group="PORTDC" index="0"/>
              <signal pad="PA4" function="X1" group="PORTDC" index="1"/>
              <signal pad="PA5" function="X1" group="PORTDC" index="2"/>
              <signal pad="PA9" function="X1" group="PORTDC" index="3"/>
              <signal pad="PA10" function="X1" group="PORTDC" index="4"/>
              <signal pad="PA11" function="X1" group="PORTDC" index="5"/>
              <signal pad="PA12" function="X1" group="PORTDC" index="6"/>
              <signal pad="PA13" function="X1" group="PORTDC" index="7"/>
              <signal pad="PA14" function="X1" group="PORTDCEN" index="1"/>
              <signal pad="PA21" function="X1" group="PORTDCEN" index="2"/>
              <signal pad="PA22" function="X1" group="PORTDCCLK"/>
            </signals>
          </instance>
        </module>
