zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70144.atdf
        <register caption="Lock Status" name="PORT_LOCKSR" offset="0x00E0" rw="R" size="4">
          <bitfield caption="Lock Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Lock Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Lock Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Lock Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Lock Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Lock Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Lock Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Lock Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Lock Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Lock Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Lock Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Lock Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Lock Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Lock Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Lock Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Lock Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Lock Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Lock Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Lock Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Lock Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Lock Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Lock Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Lock Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Lock Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Lock Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Lock Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Lock Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Lock Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Lock Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Lock Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Lock Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Lock Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Write Protection Mode Register" name="PORT_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PORT_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PORT_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Schmitt Trigger Register" name="PORT_SCHMITT" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Schmitt Trigger Control" mask="0x00000001" name="SCHMITT0"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000002" name="SCHMITT1"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000004" name="SCHMITT2"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000008" name="SCHMITT3"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000010" name="SCHMITT4"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000020" name="SCHMITT5"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000040" name="SCHMITT6"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000080" name="SCHMITT7"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000100" name="SCHMITT8"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000200" name="SCHMITT9"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000400" name="SCHMITT10"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000800" name="SCHMITT11"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00001000" name="SCHMITT12"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00002000" name="SCHMITT13"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00004000" name="SCHMITT14"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00008000" name="SCHMITT15"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00010000" name="SCHMITT16"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00020000" name="SCHMITT17"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00040000" name="SCHMITT18"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00080000" name="SCHMITT19"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00100000" name="SCHMITT20"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00200000" name="SCHMITT21"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00400000" name="SCHMITT22"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00800000" name="SCHMITT23"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x01000000" name="SCHMITT24"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x02000000" name="SCHMITT25"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x04000000" name="SCHMITT26"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x08000000" name="SCHMITT27"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x10000000" name="SCHMITT28"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x20000000" name="SCHMITT29"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x40000000" name="SCHMITT30"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x80000000" name="SCHMITT31"/>
        </register>
        <register caption="I/O Drive Register" name="PORT_DRIVER" offset="0x0118" rw="RW" size="4">
          <bitfield caption="Drive of PORT Line 0" mask="0x00000001" name="LINE0" values="PORT_DRIVER__LINE0"/>
          <bitfield caption="Drive of PORT Line 1" mask="0x00000002" name="LINE1" values="PORT_DRIVER__LINE1"/>
          <bitfield caption="Drive of PORT Line 2" mask="0x00000004" name="LINE2" values="PORT_DRIVER__LINE2"/>
          <bitfield caption="Drive of PORT Line 3" mask="0x00000008" name="LINE3" values="PORT_DRIVER__LINE3"/>
          <bitfield caption="Drive of PORT Line 4" mask="0x00000010" name="LINE4" values="PORT_DRIVER__LINE4"/>
          <bitfield caption="Drive of PORT Line 5" mask="0x00000020" name="LINE5" values="PORT_DRIVER__LINE5"/>
          <bitfield caption="Drive of PORT Line 6" mask="0x00000040" name="LINE6" values="PORT_DRIVER__LINE6"/>
          <bitfield caption="Drive of PORT Line 7" mask="0x00000080" name="LINE7" values="PORT_DRIVER__LINE7"/>
          <bitfield caption="Drive of PORT Line 8" mask="0x00000100" name="LINE8" values="PORT_DRIVER__LINE8"/>
          <bitfield caption="Drive of PORT Line 9" mask="0x00000200" name="LINE9" values="PORT_DRIVER__LINE9"/>
          <bitfield caption="Drive of PORT Line 10" mask="0x00000400" name="LINE10" values="PORT_DRIVER__LINE10"/>
          <bitfield caption="Drive of PORT Line 11" mask="0x00000800" name="LINE11" values="PORT_DRIVER__LINE11"/>
          <bitfield caption="Drive of PORT Line 12" mask="0x00001000" name="LINE12" values="PORT_DRIVER__LINE12"/>
          <bitfield caption="Drive of PORT Line 13" mask="0x00002000" name="LINE13" values="PORT_DRIVER__LINE13"/>
          <bitfield caption="Drive of PORT Line 14" mask="0x00004000" name="LINE14" values="PORT_DRIVER__LINE14"/>
          <bitfield caption="Drive of PORT Line 15" mask="0x00008000" name="LINE15" values="PORT_DRIVER__LINE15"/>
          <bitfield caption="Drive of PORT Line 16" mask="0x00010000" name="LINE16" values="PORT_DRIVER__LINE16"/>
          <bitfield caption="Drive of PORT Line 17" mask="0x00020000" name="LINE17" values="PORT_DRIVER__LINE17"/>
          <bitfield caption="Drive of PORT Line 18" mask="0x00040000" name="LINE18" values="PORT_DRIVER__LINE18"/>
          <bitfield caption="Drive of PORT Line 19" mask="0x00080000" name="LINE19" values="PORT_DRIVER__LINE19"/>
          <bitfield caption="Drive of PORT Line 20" mask="0x00100000" name="LINE20" values="PORT_DRIVER__LINE20"/>
          <bitfield caption="Drive of PORT Line 21" mask="0x00200000" name="LINE21" values="PORT_DRIVER__LINE21"/>
          <bitfield caption="Drive of PORT Line 22" mask="0x00400000" name="LINE22" values="PORT_DRIVER__LINE22"/>
          <bitfield caption="Drive of PORT Line 23" mask="0x00800000" name="LINE23" values="PORT_DRIVER__LINE23"/>
          <bitfield caption="Drive of PORT Line 24" mask="0x01000000" name="LINE24" values="PORT_DRIVER__LINE24"/>
          <bitfield caption="Drive of PORT Line 25" mask="0x02000000" name="LINE25" values="PORT_DRIVER__LINE25"/>
          <bitfield caption="Drive of PORT Line 26" mask="0x04000000" name="LINE26" values="PORT_DRIVER__LINE26"/>
          <bitfield caption="Drive of PORT Line 27" mask="0x08000000" name="LINE27" values="PORT_DRIVER__LINE27"/>
          <bitfield caption="Drive of PORT Line 28" mask="0x10000000" name="LINE28" values="PORT_DRIVER__LINE28"/>
          <bitfield caption="Drive of PORT Line 29" mask="0x20000000" name="LINE29" values="PORT_DRIVER__LINE29"/>
          <bitfield caption="Drive of PORT Line 30" mask="0x40000000" name="LINE30" values="PORT_DRIVER__LINE30"/>
          <bitfield caption="Drive of PORT Line 31" mask="0x80000000" name="LINE31" values="PORT_DRIVER__LINE31"/>
        </register>
        <register caption="Parallel Capture Mode Register" name="PORT_PCMR" offset="0x0150" rw="RW" size="4">
          <bitfield caption="Parallel Capture Mode Enable" mask="0x00000001" name="PCEN"/>
          <bitfield caption="Parallel Capture Mode Data Size" mask="0x00000030" name="DSIZE" values="PORT_PCMR__DSIZE"/>
          <bitfield caption="Parallel Capture Mode Always Sampling" mask="0x00000200" name="ALWYS"/>
          <bitfield caption="Parallel Capture Mode Half Sampling" mask="0x00000400" name="HALFS"/>
          <bitfield caption="Parallel Capture Mode First Sample" mask="0x00000800" name="FRSTS"/>
        </register>
        <register caption="Parallel Capture Interrupt Enable Register" name="PORT_PCIER" offset="0x0154" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Enable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Enable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Enable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Disable Register" name="PORT_PCIDR" offset="0x0158" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Disable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Disable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Disable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Mask Register" name="PORT_PCIMR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Mask" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Mask" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Mask" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Status Register" name="PORT_PCISR" offset="0x0160" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error" mask="0x00000002" name="OVRE"/>
        </register>
        <register caption="Parallel Capture Reception Holding Register" name="PORT_PCRHR" offset="0x0164" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Reception Data" mask="0xFFFFFFFF" name="RDATA"/>
        </register>
      </register-group>
      <value-group caption="" name="PORT_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE0">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
