zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70144.atdf
        <register caption="PWMC Interrupt Mask Register 1" name="PWMC_IMR1" offset="0x18" rw="R" size="4" atomic-op="read:PWMC_IMR1">
          <bitfield caption="Counter Event on Channel 0 Interrupt Mask" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Mask" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Mask" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Mask" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Mask" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Mask" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Mask" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Mask" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWMC Interrupt Status Register 1" name="PWMC_ISR1" offset="0x1C" rw="R" size="4" atomic-op="clear:PWMC_ISR1">
          <bitfield caption="Counter Event on Channel 0" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWMC Sync Channels Mode Register" name="PWMC_SCM" offset="0x20" rw="RW" size="4">
          <bitfield caption="Synchronous Channel 0" mask="0x00000001" name="SYNC0"/>
          <bitfield caption="Synchronous Channel 1" mask="0x00000002" name="SYNC1"/>
          <bitfield caption="Synchronous Channel 2" mask="0x00000004" name="SYNC2"/>
          <bitfield caption="Synchronous Channel 3" mask="0x00000008" name="SYNC3"/>
          <bitfield caption="Synchronous Channels Update Mode" mask="0x00030000" name="UPDM" values="PWM_SCM__UPDM"/>
          <bitfield caption="DMA Controller Transfer Request Mode" mask="0x00100000" name="PTRM"/>
          <bitfield caption="DMA Controller Transfer Request Comparison Selection" mask="0x00E00000" name="PTRCS"/>
        </register>
        <register caption="PWMC DMA Register" name="PWMC_DMAR" offset="0x24" rw="W" size="4">
          <bitfield caption="Duty-Cycle Holding Register for DMA Access" mask="0x00FFFFFF" name="DMADUTY"/>
        </register>
        <register caption="PWMC Sync Channels Update Control Register" name="PWMC_SCUC" offset="0x28" rw="RW" size="4">
          <bitfield caption="Synchronous Channels Update Unlock" mask="0x00000001" name="UPDULOCK"/>
        </register>
        <register caption="PWMC Sync Channels Update Period Register" name="PWMC_SCUP" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Update Period" mask="0x0000000F" name="UPR"/>
          <bitfield caption="Update Period Counter" mask="0x000000F0" name="UPRCNT"/>
        </register>
        <register caption="PWMC Sync Channels Update Period Update Register" name="PWMC_SCUPUPD" offset="0x30" rw="W" size="4">
          <bitfield caption="Update Period Update" mask="0x0000000F" name="UPRUPD"/>
        </register>
        <register caption="PWMC Interrupt Enable Register 2" name="PWMC_IER2" offset="0x34" rw="W" size="4" atomic-op="set:PWMC_IMR2">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Enable" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Enable" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Enable" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Enable" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Enable" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Enable" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Enable" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Enable" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Enable" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Enable" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Enable" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Enable" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Enable" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Enable" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Enable" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Enable" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Enable" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Enable" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWMC Interrupt Disable Register 2" name="PWMC_IDR2" offset="0x38" rw="W" size="4" atomic-op="clear:PWMC_IMR2">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Disable" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Disable" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Disable" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Disable" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Disable" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Disable" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Disable" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Disable" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Disable" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Disable" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Disable" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Disable" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Disable" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Disable" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Disable" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Disable" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Disable" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Disable" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWMC Interrupt Mask Register 2" name="PWMC_IMR2" offset="0x3C" rw="R" size="4" atomic-op="read:PWMC_IMR2">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Mask" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Mask" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Mask" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Mask" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Mask" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Mask" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Mask" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Mask" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Mask" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Mask" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Mask" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Mask" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Mask" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Mask" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Mask" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Mask" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Mask" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Mask" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWMC Interrupt Status Register 2" name="PWMC_ISR2" offset="0x40" rw="R" size="4" atomic-op="clear:PWMC_ISR2">
          <bitfield caption="Write Ready for Synchronous Channels Update" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWMC Output Override Value Register" name="PWMC_OOV" offset="0x44" rw="RW" size="4">
          <bitfield caption="Output Override Value for PWMH output of the channel 0" mask="0x00000001" name="OOVH0"/>
          <bitfield caption="Output Override Value for PWMH output of the channel 1" mask="0x00000002" name="OOVH1"/>
          <bitfield caption="Output Override Value for PWMH output of the channel 2" mask="0x00000004" name="OOVH2"/>
          <bitfield caption="Output Override Value for PWMH output of the channel 3" mask="0x00000008" name="OOVH3"/>
          <bitfield caption="Output Override Value for PWML output of the channel 0" mask="0x00010000" name="OOVL0"/>
          <bitfield caption="Output Override Value for PWML output of the channel 1" mask="0x00020000" name="OOVL1"/>
          <bitfield caption="Output Override Value for PWML output of the channel 2" mask="0x00040000" name="OOVL2"/>
          <bitfield caption="Output Override Value for PWML output of the channel 3" mask="0x00080000" name="OOVL3"/>
        </register>
