zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70144.atdf
        <register caption="PWMC Output Selection Register" name="PWMC_OS" offset="0x48" rw="RW" size="4">
          <bitfield caption="Output Selection for PWMH output of the channel 0" mask="0x00000001" name="OSH0"/>
          <bitfield caption="Output Selection for PWMH output of the channel 1" mask="0x00000002" name="OSH1"/>
          <bitfield caption="Output Selection for PWMH output of the channel 2" mask="0x00000004" name="OSH2"/>
          <bitfield caption="Output Selection for PWMH output of the channel 3" mask="0x00000008" name="OSH3"/>
          <bitfield caption="Output Selection for PWML output of the channel 0" mask="0x00010000" name="OSL0"/>
          <bitfield caption="Output Selection for PWML output of the channel 1" mask="0x00020000" name="OSL1"/>
          <bitfield caption="Output Selection for PWML output of the channel 2" mask="0x00040000" name="OSL2"/>
          <bitfield caption="Output Selection for PWML output of the channel 3" mask="0x00080000" name="OSL3"/>
        </register>
        <register caption="PWMC Output Selection Set Register" name="PWMC_OSS" offset="0x4C" rw="W" size="4">
          <bitfield caption="Output Selection Set for PWMH output of the channel 0" mask="0x00000001" name="OSSH0"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 1" mask="0x00000002" name="OSSH1"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 2" mask="0x00000004" name="OSSH2"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 3" mask="0x00000008" name="OSSH3"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 0" mask="0x00010000" name="OSSL0"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 1" mask="0x00020000" name="OSSL1"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 2" mask="0x00040000" name="OSSL2"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 3" mask="0x00080000" name="OSSL3"/>
        </register>
        <register caption="PWMC Output Selection Clear Register" name="PWMC_OSC" offset="0x50" rw="W" size="4">
          <bitfield caption="Output Selection Clear for PWMH output of the channel 0" mask="0x00000001" name="OSCH0"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 1" mask="0x00000002" name="OSCH1"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 2" mask="0x00000004" name="OSCH2"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 3" mask="0x00000008" name="OSCH3"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 0" mask="0x00010000" name="OSCL0"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 1" mask="0x00020000" name="OSCL1"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 2" mask="0x00040000" name="OSCL2"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 3" mask="0x00080000" name="OSCL3"/>
        </register>
        <register caption="PWMC Output Selection Set Update Register" name="PWMC_OSSUPD" offset="0x54" rw="W" size="4">
          <bitfield caption="Output Selection Set for PWMH output of the channel 0" mask="0x00000001" name="OSSUPH0"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 1" mask="0x00000002" name="OSSUPH1"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 2" mask="0x00000004" name="OSSUPH2"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 3" mask="0x00000008" name="OSSUPH3"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 0" mask="0x00010000" name="OSSUPL0"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 1" mask="0x00020000" name="OSSUPL1"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 2" mask="0x00040000" name="OSSUPL2"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 3" mask="0x00080000" name="OSSUPL3"/>
        </register>
        <register caption="PWMC Output Selection Clear Update Register" name="PWMC_OSCUPD" offset="0x58" rw="W" size="4">
          <bitfield caption="Output Selection Clear for PWMH output of the channel 0" mask="0x00000001" name="OSCUPH0"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 1" mask="0x00000002" name="OSCUPH1"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 2" mask="0x00000004" name="OSCUPH2"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 3" mask="0x00000008" name="OSCUPH3"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 0" mask="0x00010000" name="OSCUPL0"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 1" mask="0x00020000" name="OSCUPL1"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 2" mask="0x00040000" name="OSCUPL2"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 3" mask="0x00080000" name="OSCUPL3"/>
        </register>
        <register caption="PWMC Fault Mode Register" name="PWMC_FMR" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Fault Polarity" mask="0x000000FF" name="FPOL"/>
          <bitfield caption="Fault Activation Mode" mask="0x0000FF00" name="FMOD"/>
          <bitfield caption="Fault Filtering" mask="0x00FF0000" name="FFIL"/>
        </register>
        <register caption="PWMC Fault Status Register" name="PWMC_FSR" offset="0x60" rw="R" size="4">
          <bitfield caption="Fault Input Value" mask="0x000000FF" name="FIV"/>
          <bitfield caption="Fault Status" mask="0x0000FF00" name="FS"/>
        </register>
        <register caption="PWMC Fault Clear Register" name="PWMC_FCR" offset="0x64" rw="W" size="4">
          <bitfield caption="Fault Clear" mask="0x000000FF" name="FCLR"/>
        </register>
        <register caption="PWMC Fault Protection Value Register 1" name="PWMC_FPV1" offset="0x68" rw="RW" size="4">
          <bitfield caption="Fault Protection Value for PWMH output on channel 0" mask="0x00000001" name="FPVH0"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 1" mask="0x00000002" name="FPVH1"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 2" mask="0x00000004" name="FPVH2"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 3" mask="0x00000008" name="FPVH3"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 0" mask="0x00010000" name="FPVL0"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 1" mask="0x00020000" name="FPVL1"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 2" mask="0x00040000" name="FPVL2"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 3" mask="0x00080000" name="FPVL3"/>
        </register>
        <register caption="PWMC Fault Protection Enable Register" name="PWMC_FPE" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Fault Protection Enable for channel 0" mask="0x000000FF" name="FPE0"/>
          <bitfield caption="Fault Protection Enable for channel 1" mask="0x0000FF00" name="FPE1"/>
          <bitfield caption="Fault Protection Enable for channel 2" mask="0x00FF0000" name="FPE2"/>
          <bitfield caption="Fault Protection Enable for channel 3" mask="0xFF000000" name="FPE3"/>
        </register>
        <register caption="PWMC Event Line 0 Mode Register 0" name="PWMC_ELMR" offset="0x7C" rw="RW" size="4" count="2">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
