zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70144.atdf
        <register caption="Device Frame Number Register" name="USBHS_DEVFNUM" offset="0x0020" rw="R" size="4">
          <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Number CRC Error" mask="0x00008000" name="FNCERR"/>
        </register>
        <register caption="Device Endpoint Configuration Register" name="USBHS_DEVEPTCFG" offset="0x100" rw="RW" size="4" count="10">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Status Register" name="USBHS_DEVEPTISR" offset="0x130" rw="R" size="4" count="10">
          <mode name="CTRL_BULK_INT" caption="Control, Bulk and Interrupt Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_DEVEPTCFG.EPTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield modes="ISOCHRONOUS" caption="Underflow Interrupt" mask="0x00000004" name="UNDERFI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield modes="ISOCHRONOUS" caption="High Bandwidth Isochronous IN Underflow Error Interrupt" mask="0x00000008" name="HBISOINERRI"/>
          <bitfield modes="ISOCHRONOUS" caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield modes="ISOCHRONOUS" caption="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANS"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield modes="CTRL_BULK_INT" caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Clear Register" name="USBHS_DEVEPTICR" offset="0x160" rw="W" size="4" count="10" atomic-op="clear:USBHS_DEVEPTISR">
          <mode name="ISOCHRONOUS" qualifier="USBHS_DEVEPTCFG.EPTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield modes="ISOCHRONOUS" caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield modes="ISOCHRONOUS" caption="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" mask="0x00000008" name="HBISOINERRIC"/>
          <bitfield modes="ISOCHRONOUS" caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Set Register" name="USBHS_DEVEPTIFR" offset="0x190" rw="W" size="4" count="10" atomic-op="set:USBHS_DEVEPTISR">
          <mode name="ISOCHRONOUS" qualifier="USBHS_DEVEPTCFG.EPTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield modes="ISOCHRONOUS" caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield modes="ISOCHRONOUS" caption="High Bandwidth Isochronous IN Underflow Error Interrupt Set" mask="0x00000008" name="HBISOINERRIS"/>
          <bitfield modes="ISOCHRONOUS" caption="High Bandwidth Isochronous IN Flush Interrupt Set" mask="0x00000010" name="HBISOFLUSHIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
