zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70144.atdf
      <value-group caption="" name="XDMAC_CC10__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__SIF">
        <value caption="The data is read through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is read through the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__DIF">
        <value caption="The data is written through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is written though the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__SAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__DAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__INITD">
        <value caption="Channel initialization is in progress." name="IN_PROGRESS" value="0"/>
        <value caption="Channel initialization is completed." name="TERMINATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__RDIP">
        <value caption="No active read transaction on the bus." name="DONE" value="0"/>
        <value caption="A read transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC10__WRIP">
        <value caption="No active write transaction on the bus." name="DONE" value="0"/>
        <value caption="A write transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC11__NDE">
        <value caption="Descriptor fetch is disabled." name="DSCR_FETCH_DIS" value="0"/>
        <value caption="Descriptor fetch is enabled." name="DSCR_FETCH_EN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC11__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC11__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC11__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC11__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
      </value-group>
